GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from c:\Users\Daniel\Desktop\CS2\cpp_intro\debugging2.exe...done.
(gdb) break deg bugging2. .cpp:77
Breakpoint 1 at 0x4014c8: file debugging2.cpp, line 77.
(gdb) run
Starting program: c:\Users\Daniel\Desktop\CS2\cpp_intro/./debugging2.exe 
[New Thread 10716.0x3ec8]
[New Thread 10716.0x1e0c]
[New Thread 10716.0x376c]
[New Thread 10716.0x2484]

Breakpoint 1, main (argc=1, argv=0x2f316b8) at debugging2.cpp:78
78	    cout << divide(15625, 37) << endl;
(gdb) step
divide (a=15625, b=37) at debugging2.cpp:33
33	    unsigned int x = 0, y = 0, z = sizeof(a) * 8;
(gdb) backtrace
#0  divide (a=15625, b=37) at debugging2.cpp:33
#1  0x004014dc in main (argc=1, argv=0x2f316b8) at debugging2.cpp:78
(gdb) print x
$1 = 979842995
(gdb) print y
$2 = 1941424240
(gdb) print a 
$3 = 15625
(gdb) print b
$4 = 37
(gdb) print a / b
$5 = 422
(gdb) step
35	    while (z != 0)
(gdb) print x
$6 = 0
(gdb) print y
$7 = 0
(gdb) print a
$8 = 15625
(gdb) print b
$9 = 37
(gdb) continue
Continuing.
422
[Inferior 1 (process 10716) exited normally]
(gdb) quit
